#include "Library.h"
using namespace std;

void background() {
	setlocale(LC_ALL, "RU");

	cout << endl << "Однажды, в незапамятные времена, жили люди, эльфы, орки, гномы и множество других рас в так называемом верхнем мире. Это было так давно, что упоминания о верхнем мире." << endl;
	cout << "Сейчас это скорее сказки для наших детей, которые живут здесь и сейчас - в Андерленде. А сам этот мир, скорее даже не мир, а пространтсво между Старым, Верхним миром, и преисподней." << endl;
	cout << "Это место абсолютной тьмы и пустоты. Сам мир систоит из огромных колонн, высотой, порой достигающих от самого низа, до самого верха. А сделаны они из божественного камня, " << endl;
	cout << "который залаживали еще сами демиурги, создатели миров, с целью постоянного поддержания целостности мира. Иначе, если колонны разрушаться, разрушится равновесие на уровне мироздания " << endl;
	cout << "и случится так называемый катаклизм - соединение Верхнего мира и Преисподней, что в свою очередь способно вызвать цепную реакцию, уничтожив и остальные миры и их наместников." << endl;
	cout << "То есть богов. И останется лишь пустота, среди бескрайней Вселенной." << endl;

	system("pause");

	cout << endl << "Дак как же так получилось, что мы попали в столь забытое богами место. Пророчество, написанное во времена строительства первых городов верхнего мира, гласило, что если руки одной из великих на то время рас" << endl;
	cout << "будут запачканы в крови, то произойдет Великое Переселение. Что это значило, никто на то время не знал, но пророчеству придерживались все. Правда со временем его начали забывать. Спустя столетия было возведено бесчиленное количество городов." << endl;
	cout << "Всё оставалось мирным, до, так называемого, Великого предательства. Люди, как им свойственно по природе, крайне коварны и жадны. Они долго готовились к великой войне народов, в сердце их гремели звуки надвигающегося шторма." << endl;
	cout << "А кожу пронизывал адреналиновый холод. Тогда началась, пожалуй самая масштабная, кровопролитная, а главное безжалостная война в истории нашей расы. Были убиты миллионы невинных, сожжены десятки городов до тла." << endl;
	cout << "Те кто выжили, бежали прочь, находя приют в горах. Завоевания длились порядка семи лет. За это время была уничтожена столица эльфов Нис'Арг и сожжено древо жизни Антарес, замурована вместе с ее жителями столица гномов Гаренварг." << endl;
	cout << "Люди, почувствовав вкус крови, возомнили себя богами. Отныне они были способны диктовать правила этому миру. Но произошло непоправимое..." << endl;

	system("pause");

	cout << endl << "Вдоволь насытившись чужой крови, внезапно пришло осознание содеянного. Люди и другие народы вспомнили древнее предание. И начался хаос в рядах людей. Следовали революции, суды, гражданские войны шли одна за одной." << endl;
	cout << "В конечном итоге это привело к тому, что люди, по велению высших богов, были отправлены в то самое Великое переселение на неопределенный срок. Если коротко говоря - весь народ человеческий был изгнан в Андерленд - " << endl;
	cout << "пространство страха и боли, тьмы и пустоты, горя и отчаяния. Этот мир является некой гробницей великих рас, которые были изгнаны из своих миров за неповиновение Высшим богам. А так же это место было и кладбищем тех самых великих рас." << endl;
	cout << "Среди них: Архитекторы - творцы пространства-времени, Предтечи - одна из самых древнейших рас-завоевателей, а также те самые Демиурги - создатели древнейших миров." << endl;
	cout << "Отсюда и началась история изгнания и становления человечества, как самой противоречивой расы во всей Вселенной." << endl;

	cout << endl;
	
	return;
}